data/Parm_PH_29/alpha_05/alpha_05_4071_3036/0/U_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
15600
(
(0.05641504 0.00071578 0.00000000)
(0.04414823 0.00015043 0.00000000)
(-0.00185786 -0.00197943 0.00000000)
(-0.00328062 0.00311249 0.00000000)
(-0.00561144 0.00463648 0.00000000)
(-0.00283669 0.00232275 0.00000000)
(-0.00117656 0.00078074 0.00000000)
(-0.00106386 0.00130225 0.00000000)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
