data/Parm_PH_29/alpha_05/alpha_05_4071_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00550347 -0.00006896 0.00000000 0.00000693 0.00000000 0.00336482)
(0.00489243 -0.00004440 0.00000000 -0.00000285 0.00000000 0.00230304)
(-0.00058664 0.00000024 0.00000000 0.00008525 0.00000000 0.00060948)
(0.00012940 -0.00010891 0.00000000 0.00009058 0.00000000 0.00027845)
(0.00025832 -0.00022706 0.00000000 0.00020451 0.00000000 0.00067471)
(0.00011638 -0.00009619 0.00000000 0.00006382 0.00000000 0.00057855)
(0.00004235 -0.00001140 0.00000000 -0.00002582 0.00000000 0.00013871)
(0.00002527 -0.00002164 0.00000000 0.00001211 0.00000000 0.00018453)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
